Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.Guid
The Guid class represents the GUID filter expression.

Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.Guid.#ctor
Initializes a new instance of the Guid class.